wolfSSL/wolfip/src/port/stm32h563/main.c
/* main.c
 *
 * Copyright (C) 2026 wolfSSL Inc.
 *
 * This file is part of wolfIP TCP/IP stack.
 *
 * wolfIP is free software; you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation; either version 3 of the License, or
 * (at your option) any later version.
 *
 * wolfIP is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program; if not, write to the Free Software
 * Foundation, Inc., 51 Franklin Street, Fifth Floor, Boston, MA 02110-1335, USA
 */
#include <stdint.h>
#include <string.h>
#include "config.h"
#include "wolfip.h"
#include "stm32h5_eth.h"

#ifdef ENABLE_TLS
#include "tls_server.h"
#include "tls_client.h"
#define TLS_PORT 8443
#endif

#ifdef ENABLE_HTTPS
#include "http/httpd.h"
#include "certs.h"
#define HTTPS_WEB_PORT 443
#endif

#ifdef ENABLE_SSH
#include "ssh_server.h"
#define SSH_PORT 22
#endif

#ifdef ENABLE_MQTT
#include "mqtt_client.h"
#endif

#ifdef M33MU_TEST
/* Test mode configuration for m33mu emulator */
  #ifdef BUILD_TLS_SERVER_ONLY
    #define TEST_SERVER_IP "192.168.100.10"
  #endif
  #ifdef BUILD_TLS_CLIENT_ONLY
    #define TEST_SERVER_IP "192.168.100.10"
    #define TEST_CLIENT_IP "192.168.100.20"
  #endif
  #define TEST_NETMASK "255.255.255.0"
  #define TEST_GATEWAY "192.168.100.1"
#endif

#if defined(ENABLE_TLS) && !defined(BUILD_TLS_SERVER_ONLY)

/* Google IP for TLS client test (run: dig +short google.com) */
#define GOOGLE_IP "142.250.189.174"
#define GOOGLE_HTTPS_PORT 443

/* TLS client test state */
static int tls_client_test_started = 0;
static int tls_client_test_done = 0;
#endif

#ifdef ENABLE_HTTPS
/* HTTPS server using wolfIP httpd */
static struct httpd https_server;
static WOLFSSL_CTX *https_ssl_ctx;
static uint32_t https_uptime_sec;
static ip4 https_device_ip;

/* Status page handler */
static int https_status_handler(struct httpd *httpd, struct http_client *hc,
    struct http_request *req)
{
    char response[512];
    char ip_str[16];
    char uptime_str[12];
    int len;

    (void)httpd;
    (void)req;

    /* Format IP address (stored in network byte order) */
    {
        uint8_t *b = (uint8_t *)&https_device_ip;
        char *p = ip_str;
        for (int i = 3; i >= 0; i--) {  /* Reverse order for network byte order */
            int val = b[i];
            if (val >= 100) { *p++ = '0' + val / 100; val %= 100; }
            if (val >= 10 || b[i] >= 100) { *p++ = '0' + val / 10; val %= 10; }
            *p++ = '0' + val;
            if (i > 0) *p++ = '.';
        }
        *p = '\0';
    }

    /* Format uptime */
    {
        uint32_t val = https_uptime_sec;
        char tmp[12];
        int i = 0, j = 0;
        if (val == 0) { uptime_str[0] = '0'; uptime_str[1] = '\0'; }
        else {
            while (val > 0) { tmp[i++] = '0' + (val % 10); val /= 10; }
            while (i > 0) { uptime_str[j++] = tmp[--i]; }
            uptime_str[j] = '\0';
        }
    }

    /* Build HTML response */
    len = snprintf(response, sizeof(response),
        "<!DOCTYPE html><html><head><title>wolfIP STM32H563</title>"
        "<style>body{font-family:sans-serif;margin:40px;}"
        "h1{color:#333;}table{border-collapse:collapse;}"
        "td{padding:8px 16px;border:1px solid #ddd;}</style></head>"
        "<body><h1>wolfIP Status</h1><table>"
        "<tr><td>Device</td><td>STM32H563</td></tr>"
        "<tr><td>IP Address</td><td>%s</td></tr>"
        "<tr><td>Uptime</td><td>%s sec</td></tr>"
        "<tr><td>TLS</td><td>TLS 1.3</td></tr>"
        "</table></body></html>",
        ip_str, uptime_str);

    http_send_response_headers(hc, HTTP_STATUS_OK, "OK", "text/html", len);
    http_send_response_body(hc, response, len);
    return 0;
}
#endif

#define ECHO_PORT 7
#define RX_BUF_SIZE 1024

#if TZEN_ENABLED
#define RCC_BASE 0x54020C00u  /* Secure alias */
#define ETH_BASE_DBG 0x50028000u  /* Secure ETH for debug */
#else
#define RCC_BASE 0x44020C00u  /* Non-secure alias */
#define ETH_BASE_DBG 0x40028000u  /* Non-secure ETH for debug */
#endif
#define RCC_AHB1ENR  (*(volatile uint32_t *)(RCC_BASE + 0x88u))
#define RCC_AHB2ENR  (*(volatile uint32_t *)(RCC_BASE + 0x8Cu))
#define RCC_APB3ENR  (*(volatile uint32_t *)(RCC_BASE + 0xA8u))
#define RCC_AHB1RSTR (*(volatile uint32_t *)(RCC_BASE + 0x60u))
#define RCC_AHB1RSTR_ETHRST (1u << 19)

/* SAU (Security Attribution Unit) - mark memory regions as non-secure */
#define SAU_CTRL   (*(volatile uint32_t *)0xE000EDD0u)
#define SAU_RNR    (*(volatile uint32_t *)0xE000EDD8u)
#define SAU_RBAR   (*(volatile uint32_t *)0xE000EDDCu)
#define SAU_RLAR   (*(volatile uint32_t *)0xE000EDE0u)

/* GTZC (Global TrustZone Controller) - unlock SRAM for DMA access */
#if TZEN_ENABLED
/* Secure addresses when running in secure mode with TZEN=1 */
#define GTZC1_BASE         0x50032400u  /* Secure alias */
#else
#define GTZC1_BASE         0x40032400u  /* Non-secure alias */
#endif
#define GTZC1_MPCBB1_CR    (*(volatile uint32_t *)(GTZC1_BASE + 0x800u))
#define GTZC1_MPCBB2_CR    (*(volatile uint32_t *)(GTZC1_BASE + 0xC00u))
#define GTZC1_MPCBB3_CR    (*(volatile uint32_t *)(GTZC1_BASE + 0x1000u))
/* MPCBB SECCFGR registers - each bit controls 256 bytes of SRAM */
#define GTZC1_MPCBB3_SECCFGR(n) (*(volatile uint32_t *)(GTZC1_BASE + 0x1000u + 0x100u + ((n) * 4u)))
/* MPCBB PRIVCFGR registers - each bit controls privilege for 256 bytes of SRAM */
#define GTZC1_MPCBB3_PRIVCFGR(n) (*(volatile uint32_t *)(GTZC1_BASE + 0x1000u + 0x200u + ((n) * 4u)))
/* TZSC SECCFGR registers - control peripheral security */
#define GTZC1_TZSC_SECCFGR1 (*(volatile uint32_t *)(GTZC1_BASE + 0x010u))
#define GTZC1_TZSC_SECCFGR2 (*(volatile uint32_t *)(GTZC1_BASE + 0x014u))
#define GTZC1_TZSC_SECCFGR3 (*(volatile uint32_t *)(GTZC1_BASE + 0x018u))

/* GPIO base addresses */
#if TZEN_ENABLED
#define GPIOA_BASE 0x52020000u  /* Secure alias */
#define GPIOB_BASE 0x52020400u
#define GPIOC_BASE 0x52020800u
#define GPIOG_BASE 0x52021800u
#else
#define GPIOA_BASE 0x42020000u  /* Non-secure alias */
#define GPIOB_BASE 0x42020400u
#define GPIOC_BASE 0x42020800u
#define GPIOG_BASE 0x42021800u
#endif

